app/Http/Controllers/UsersController.php

select * from `users` where `id` != 3
---
    public function index(){
        $users = User::where('id', '!=', auth()->user()->id)->get();